Revit 2027 API
Categories.Contains Method
Identifies if a category which has the specified name is in the list of top-level categories.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override bool Contains(
	string name
)
Public Overrides Function Contains (
	name As String
) As Boolean
public:
virtual bool Contains(
	String^ name
) override
abstract Contains :
        name : string -> bool
override Contains :
        name : string -> bool
Parameters
name String
The name of the category to be retrieved.
Field Value
Boolean
Whether the category exists in the list of top-level categories.
See Also
Reference
Categories Class
Autodesk.Revit.DB Namespace